# 1. Создать переменные john_salary и marta_salary вещественного типа (с плавающей точкой). Присвоить созданным переменным значения по
# своему усмотрению. Вывести в консоль методом print значения обеих переменных.

john_salary = 1110.05
marta_salary = 1350.26

if __name__ == "__main__":
    print(john_salary)
    print(marta_salary)
