# Реализовать библиотеку с любым функционалом. К примеру создайте функции
# для арифметических операций и выстроите фасад из импортов. Хочу иметь
# возможность импортировать кое какие функции из пакета но не все.

from lesson9.homework9.task1 import subtraction


print(subtraction(3, 1))
