# 3. Создать переменные john_name и marta_name строкового типа. Присвоить созданным переменным значения по своему усмотрению. Вывести в
# консоль методом print значения обеих переменных.
john_name = "John Doe"
marta_name = "Marta Doe"

if __name__ == "__main__":
    print(john_name)
    print(marta_name)
# Good but no new line in the end od file
